In [52]:
import pandas as pd

# csv 파일 불러오기

In [3]:
df = pd.read_csv('data/friend_list.csv')

In [4]:
df

  ﻿name   age        job
0   john   20    student
1  jenny   30  developer
2   nate   30    teacher
3  julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [47]:
df.tail()

    name  age        job
1  jenny   30  developer
2   nate   30    teacher
3  julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [6]:
fl = pd.read_csv('data/friend_list.txt')

In [53]:
fl

   name   age        job
0   john   20    student
1  jenny   30  developer
2   nate   30    teacher
3  julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

## 텍스트 파일 불러오기

In [35]:
fp = pd.read_csv('data/friend_list_tab.txt')

In [36]:
fp

        name\t age\tjob
0     john\t20\tstudent
1  jenny\t30\tdeveloper
2     nate\t30\tteacher
3    julia\t40\tdentist
4    Brian\t45\tmanager
5     Chris\t25\tintern

In [37]:
fp = pd.read_csv('data/friend_list_tab.txt',delimiter='\t')

In [54]:
fp

    name   age        job
0   john    20    student
1  jenny    30  developer
2   nate    30    teacher
3  julia    40    dentist
4  Brian    45    manager
5  Chris    25     intern

## 헤더 없는 파일 불러오기

In [39]:
df = pd.read_csv('data/friend_list_no_head.csv')

In [40]:
df

   ﻿john  20    student
0  jenny  30  developer
1   nate  30    teacher
2  julia  40    dentist
3  Brian  45    manager
4  Chris  25     intern

In [41]:
df = pd.read_csv('data/friend_list_no_head.csv',header=None)

In [42]:
df

       0   1          2
0  ﻿john  20    student
1  jenny  30  developer
2   nate  30    teacher
3  julia  40    dentist
4  Brian  45    manager
5  Chris  25     intern

In [43]:
df.columns=['name','age','job']

In [44]:
df

    name  age        job
0  ﻿john   20    student
1  jenny   30  developer
2   nate   30    teacher
3  julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [45]:
df = pd.read_csv('data/friend_list_no_head.csv',header=None, names = ['name','age','job'])

In [46]:
df

    name  age        job
0  ﻿john   20    student
1  jenny   30  developer
2   nate   30    teacher
3  julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

# 파이썬 코드로 만들기

## 데이터프레임 만들기

In [49]:
s1 = pd.core.series.Series(['one','two','three'])
s2 = pd.core.series.Series([1,2,3])

In [50]:
pd.DataFrame(data= dict(word = s1, num= s2))

   num   word
0    1    one
1    2    two
2    3  three

In [57]:
friend_dict_list = [{'name': 'Jone', 'age': 20, 'job': 'student'},
                    {'name':'Jenny','age':30,'job':'developer'},
                    {'name':'Nate','age':34,'job':'teacher'}]

df = pd.DataFrame(friend_dict_list)

In [58]:
df

   age        job   name
0   20    student   Jone
1   30  developer  Jenny
2   34    teacher   Nate

dict 구조로 넣은 것과는 전혀 다른 순서로 데이터프레임이 생성 될 수도 있음

In [60]:
df = df[['name','age','job']]
df

    name  age        job
0   Jone   20    student
1  Jenny   30  developer
2   Nate   34    teacher

이렇게 직접 원하는 순서를 지정가능

## OrderDict으로 데이터 프레임 작성하기

In [61]:
from collections import OrderedDict

In [62]:
friend_ordered_dict = OrderedDict([ ('name', ['John', 'Jenny', 'Nate']),
          ('age', [20, 30, 30]),
          ('job', ['student', 'developer', 'teacher']) ] )

In [64]:
df = pd.DataFrame(friend_ordered_dict)

In [71]:
df

   name  age      job
0  John   20  student
1  Nate   30  teacher

## 리스트를 이용해 데이터 프레임 만들기

In [66]:
friend_list = [ 
    ['John', 20, 'student'],
    ['Nate',30, 'teacher']
]

In [67]:
column_name = ['name','age','job']

In [68]:
df = pd.DataFrame.from_records(friend_list, columns= column_name)

In [70]:
df

   name  age      job
0  John   20  student
1  Nate   30  teacher

이거 한번하기

In [72]:
friend_list = [
    ['name',['John','Nate','Julia']],
    ['age',[32, 12, 40]],
    ['job',['student','teacher','dentist']]
]

In [73]:
df= pd.DataFrame.from_items(friend_list)

In [74]:
df

    name  age      job
0   John   32  student
1   Nate   12  teacher
2  Julia   40  dentist